#+TITLE: The Language

* Chapter 1
#+begin_src c :tangle programs/hello.c
#include <stdio.h>

main()
{
printf("hello, world\n");
}
#+end_src

#+begin_src shell
cc hello.c
#+end_src

* Fahrenheit to Celsius

#+begin_src c :tangle programs/FahrenheitCelcius.c
#include <stdio.h>
/* print Fahrenheit-Celsius table
   for fahr = 0, 20, . .., 300; floating-point version */
main()
{
    float fahr, Celsius;
    int lower, upper, step;
    lower = 0 ;  /* lower limit of temperature table */
    upper = 300; /* upper limit */
    step = 20 ;  /* step size */
    fahr = lower;
    while (fahr <= upper) {
        Celsius = (5.0/9.0) * (fahr-32.0);
        printf ("%3.0f %6.1f\n", fahr, Celsius);
        fahr = fahr + step;
    }
}
#+end_src

#+begin_src shell
cd programs
cc FahrenheitCelcius.c
./a.out
#+end_src

#+RESULTS:
|   0 | -17.8 |
|  20 |  -6.7 |
|  40 |   4.4 |
|  60 |  15.6 |
|  80 |  26.7 |
| 100 |  37.8 |
| 120 |  48.9 |
| 140 |  60.0 |
| 160 |  71.1 |
| 180 |  82.2 |
| 200 |  93.3 |
| 220 | 104.4 |
| 240 | 115.6 |
| 260 | 126.7 |
| 280 | 137.8 |
| 300 | 148.9 |

** Exercises
*** Exercise 1-3.
Modify the temperature conversion program to print a heading
above the table.

#+begin_src c :tangle programs/FahrenheitCelcius2.c
#include <stdio.h>
/* print Fahrenheit-Celsius table
   for fahr = 0, 20, . .., 300; floating-point version */
main()
{
    float fahr, Celsius;
    int lower, upper, step;
    lower = 0 ;  /* lower limit of temperature table */
    upper = 300; /* upper limit */
    step = 20 ;  /* step size */
    fahr = lower;

    printf("----------- \t --------\n");
    printf("Fahrenheit \t Celcius \n");
    printf("----------- \t --------\n");

    while (fahr <= upper) {
        Celsius = (5.0/9.0) * (fahr-32.0);
        printf ("%3.0f %6.1f\n", fahr, Celsius);
        fahr = fahr + step;
    }
}
#+end_src

#+begin_src shell
cd programs
cc FahrenheitCelcius2.c
./a.out
#+end_src

#+RESULTS:
| ----------- | -------- |
|  Fahrenheit |  Celcius |
| ----------- | -------- |
|           0 |    -17.8 |
|          20 |     -6.7 |
|          40 |      4.4 |
|          60 |     15.6 |
|          80 |     26.7 |
|         100 |     37.8 |
|         120 |     48.9 |
|         140 |     60.0 |
|         160 |     71.1 |
|         180 |     82.2 |
|         200 |     93.3 |
|         220 |    104.4 |
|         240 |    115.6 |
|         260 |    126.7 |
|         280 |    137.8 |
|         300 |    148.9 |

*** Exercise 1-4.
Write a program to print the corresponding Celsius to Fahrenheit

#+begin_src c :tangle programs/FahrenheitCelcius3.c
#include <stdio.h>
/* print Fahrenheit-Celsius table
   for fahr = 0, 20, . .., 300; floating-point version */
main()
{
    float fahr, Celsius;
    int lower, upper, step;
    lower = 0 ;  /* lower limit of temperature table */
    upper = 300; /* upper limit */
    step = 20 ;  /* step size */
    Celsius = lower;

    printf("----------- \t --------\n");
    printf("Celcius \t Fahrenheit\n");
    printf("----------- \t --------\n");

    while (Celsius <= upper) {
        fahr=(9.0/5.0)*Celsius + 32;
        printf ("%3.0f %6.1f\n", Celsius, fahr);
        Celsius = Celsius + step;
    }
}
#+end_src

#+begin_src shell :exports both
cd programs
cc FahrenheitCelcius3.c
#+end_src

#+RESULTS:

#+begin_src shell
cd programs
./a.out
#+end_src

#+RESULTS:
| ----------- |   -------- |
|     Celcius | Fahrenheit |
| ----------- |   -------- |
|           0 |       32.0 |
|          20 |       68.0 |
|          40 |      104.0 |
|          60 |      140.0 |
|          80 |      176.0 |
|         100 |      212.0 |
|         120 |      248.0 |
|         140 |      284.0 |
|         160 |      320.0 |
|         180 |      356.0 |
|         200 |      392.0 |
|         220 |      428.0 |
|         240 |      464.0 |
|         260 |      500.0 |
|         280 |      536.0 |
|         300 |      572.0 |
